Revit 2027 API
RebarShapeDrivenAccessor.SetLayoutAsSingle Method
 Sets the Layout Rule property of rebar set to Single.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutAsSingle()
Public Sub SetLayoutAsSingle
public:
void SetLayoutAsSingle()
member SetLayoutAsSingle : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Remarks
 Only one bar will remain, which is at the position of rebar plane
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace